OdRxObjectPtr.op_Implicit~OdRxObject*
\details
Returns the raw pointer of the referenced object.
\remarks
The reference counter of the referenced object is not changed.

OdRxObjectPtr.Dispose
\details
Destructor for the non-typified smart pointer.
\remarks
Decrements the reference counter of the referenced object. When the reference count reaches zero, the referenced object is deleted.

OdRxObjectPtr.#ctor
\details
Constructors for the non-typified smart pointer.
\param pSource [in]  Pointer to the specified object to be assigned for the new SmartPointer object.
\remarks
If pSource is specified, the smart pointer is set to the address of the specified object. If pSource is not specified, the smart pointer is set to a NULL.
\remarks
If OdRxObjMod is specified, the reference counter of the specified object
is *not* incremented.

OdRxObjectPtr.assign(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Assigns the pointer of the specified object to the smart pointer.
\remarks
The reference counter of the specified object is incremented.
If this SmartPointer is currently referencing another object, that object
is released prior to the assignment.
\param pObject [in]  Pointer to the specified object to be assigned.

OdRxObjectPtr.internalAddRef
\details
Increments the reference counter of the referenced object.